run/NACA0010/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1196;
        startFace       762488;
    }
    outlet
    {
        type            patch;
        nFaces          600;
        startFace       763684;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       764284;
    }
    foil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          52;
        startFace       765084;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          763812;
        startFace       765136;
    }
)

// ************************************************************************* //
